<a href="https://colab.research.google.com/github/amit0902/Statistics/blob/main/Basic_Statistics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#**STEPS:**
##**1.** IMPORTING LIBRARIES

*   PANDAS LIBRARY
*   NUMPY
*   PLOTTING LIBRARYS
* ETC..

##**2.** READ DATASET
##**3.** RUN SOME BASIC FUNCTION TO FIND BASIC STATISTIC ANALYSIS
##**4.** FOR MORE INSIGHT USE PANDAS LIBRARY
##**5.** AFTER GOING THROUGH BASIC INSIGHT PLOT THE DATA TO GET BETTER INSIGHT FOR DISTRIBUTION OF DATA AND DRAWING RELATIONS BETWEEN CATEGORY

#***ANALYZE DATA***

---

###*IMPORTING VARIOUS LIBRARIES TO ACCESS THEM AND US THEM FOR OUR CONVENIENCE*

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

#**READING A FILE**

Depending on type of data to be loaded pd.read_file extension("Path of file.file extension") to call data

For Example to call csv file we use pd.read_csv("File Path.csv")

In [3]:
a=pd.read_csv("test.csv")
a

         ID             datetime  temperature  var1  pressure  windspeed var2
0       552  2013-07-24 00:00:00        -10.0 -16.4    1011.0    263.280    A
1       553  2013-07-24 01:00:00        -10.0 -20.7    1011.0    267.175    A
2       554  2013-07-24 02:00:00        -10.7 -17.1    1003.0    269.555    A
3       555  2013-07-24 03:00:00        -13.6 -20.7    1008.0    273.060    A
4       556  2013-07-24 04:00:00        -10.7 -17.1    1006.0      1.765    A
...     ...                  ...          ...   ...       ...        ...  ...
8563  35059  2017-06-30 19:00:00         -5.7 -18.6     998.0    233.595    A
8564  35060  2017-06-30 20:00:00         -5.7 -17.1     995.0    238.780    A
8565  35061  2017-06-30 21:00:00         -7.1 -19.3    1004.0    244.325    A
8566  35062  2017-06-30 22:00:00         -6.4 -19.3    1008.0    247.470    A
8567  35063  2017-06-30 23:00:00         -5.0 -16.4    1001.0    250.600    A

[8568 rows x 7 columns]

#Use shape to find number of rows and columns for a given dataset

In [4]:
a.shape

(8568, 7)

#Use head to find first five rows for a given data set
Python executes from n=0 to n-1; so for 5 rows it will show 0 to 4 rows

In [5]:
a.head()

    ID             datetime  temperature  var1  pressure  windspeed var2
0  552  2013-07-24 00:00:00        -10.0 -16.4    1011.0    263.280    A
1  553  2013-07-24 01:00:00        -10.0 -20.7    1011.0    267.175    A
2  554  2013-07-24 02:00:00        -10.7 -17.1    1003.0    269.555    A
3  555  2013-07-24 03:00:00        -13.6 -20.7    1008.0    273.060    A
4  556  2013-07-24 04:00:00        -10.7 -17.1    1006.0      1.765    A

#Use tail to find last 5 rows for a given data set

In [6]:
a.tail()

         ID             datetime  temperature  var1  pressure  windspeed var2
8563  35059  2017-06-30 19:00:00         -5.7 -18.6     998.0    233.595    A
8564  35060  2017-06-30 20:00:00         -5.7 -17.1     995.0    238.780    A
8565  35061  2017-06-30 21:00:00         -7.1 -19.3    1004.0    244.325    A
8566  35062  2017-06-30 22:00:00         -6.4 -19.3    1008.0    247.470    A
8567  35063  2017-06-30 23:00:00         -5.0 -16.4    1001.0    250.600    A

#After finding size and head use describe to find statistical terms for the given data set
Describe function runs only for continuous data

In [7]:
a.describe()

                 ID  temperature         var1     pressure    windspeed
count   8568.000000  8568.000000  8568.000000  8568.000000  8568.000000
mean   17766.525210     5.112757    -1.726401   986.329599    24.176398
std    10117.296415     8.606167    10.345034    12.148517    49.651535
min      552.000000   -17.900000   -26.400000   954.000000     1.075000
25%     9317.750000    -2.100000   -10.000000   977.000000     3.155000
50%    18083.500000     5.700000    -2.100000   987.000000     6.295000
75%    26297.250000    12.100000     7.900000   995.000000    21.907500
max    35063.000000    25.700000    17.900000  1023.000000   491.255000

#One can always find statistical quantity individually

In [8]:
a.mean()

ID             17766.525210
temperature        5.112757
var1              -1.726401
pressure         986.329599
windspeed         24.176398
dtype: float64

In [9]:
a.median()

ID             18083.500
temperature        5.700
var1              -2.100
pressure         987.000
windspeed          6.295
dtype: float64

In [10]:
a.std()

ID             10117.296415
temperature        8.606167
var1              10.345034
pressure          12.148517
windspeed         49.651535
dtype: float64

In [11]:
min(a.temperature)

-17.9

In [12]:
max(a.temperature)

25.7

#Codes to find overview of dataset
**DATAFRAME ATTRIBUTION**

In [13]:
a.size

59976

In [14]:
a.ndim

2

In [15]:
a.values

array([[552, '2013-07-24 00:00:00', -10.0, ..., 1011.0, 263.28, 'A'],
       [553, '2013-07-24 01:00:00', -10.0, ..., 1011.0, 267.175, 'A'],
       [554, '2013-07-24 02:00:00', -10.7, ..., 1003.0, 269.555, 'A'],
       ...,
       [35061, '2017-06-30 21:00:00', -7.1, ..., 1004.0, 244.325, 'A'],
       [35062, '2017-06-30 22:00:00', -6.4, ..., 1008.0, 247.47, 'A'],
       [35063, '2017-06-30 23:00:00', -5.0, ..., 1001.0, 250.6, 'A']],
      dtype=object)

In [16]:
a.axes

[RangeIndex(start=0, stop=8568, step=1),
 Index(['ID', 'datetime', 'temperature', 'var1', 'pressure', 'windspeed',
        'var2'],
       dtype='object')]

In [17]:
display(a)

         ID             datetime  temperature  var1  pressure  windspeed var2
0       552  2013-07-24 00:00:00        -10.0 -16.4    1011.0    263.280    A
1       553  2013-07-24 01:00:00        -10.0 -20.7    1011.0    267.175    A
2       554  2013-07-24 02:00:00        -10.7 -17.1    1003.0    269.555    A
3       555  2013-07-24 03:00:00        -13.6 -20.7    1008.0    273.060    A
4       556  2013-07-24 04:00:00        -10.7 -17.1    1006.0      1.765    A
...     ...                  ...          ...   ...       ...        ...  ...
8563  35059  2017-06-30 19:00:00         -5.7 -18.6     998.0    233.595    A
8564  35060  2017-06-30 20:00:00         -5.7 -17.1     995.0    238.780    A
8565  35061  2017-06-30 21:00:00         -7.1 -19.3    1004.0    244.325    A
8566  35062  2017-06-30 22:00:00         -6.4 -19.3    1008.0    247.470    A
8567  35063  2017-06-30 23:00:00         -5.0 -16.4    1001.0    250.600    A

[8568 rows x 7 columns]

#We can also group variable to categorize data and have a good observation

For example var2 has 3 characters namely **"A", "B", & "C"** so they can be categorized and we can see individual paramter results for each columns.

In [26]:
b=a.groupby(['var2'])
b.mean()

                ID  temperature      var1    pressure  windspeed
var2
A     17807.700868     5.014260 -2.103204  986.538462  24.771754
B     11017.104478    -6.058209 -7.022388  997.597015  15.294254
C     18123.061728     9.908642  8.878395  978.728395  10.987762

***We can further classify required data by chosing specific parameters***

In [27]:
c=a.groupby('var2')[['temperature','pressure']].mean()
c

      temperature    pressure
var2
A        5.014260  986.538462
B       -6.058209  997.597015
C        9.908642  978.728395

***We can perform various aggregation to get more enhanced data***

In [33]:
c1=a.groupby('var2')[['temperature','pressure']].agg(['min','mean','max'])
c1

     temperature                 pressure
             min      mean   max      min        mean     max
var2
A          -17.9  5.014260  25.7    954.0  986.538462  1023.0
B          -10.0 -6.058209  -2.1    982.0  997.597015  1018.0
C           -4.3  9.908642  17.1    954.0  978.728395  1010.0

#***DATA FILTER***

---

#*Filtering Data is important to find values falling in your desired range*

In [28]:
d=a[a['pressure']>1000]
d

         ID             datetime  temperature  var1  pressure  windspeed var2
0       552  2013-07-24 00:00:00        -10.0 -16.4    1011.0    263.280    A
1       553  2013-07-24 01:00:00        -10.0 -20.7    1011.0    267.175    A
2       554  2013-07-24 02:00:00        -10.7 -17.1    1003.0    269.555    A
3       555  2013-07-24 03:00:00        -13.6 -20.7    1008.0    273.060    A
4       556  2013-07-24 04:00:00        -10.7 -17.1    1006.0      1.765    A
...     ...                  ...          ...   ...       ...        ...  ...
8561  35057  2017-06-30 17:00:00         -5.7 -19.3    1001.0    222.115    A
8562  35058  2017-06-30 18:00:00         -6.4 -17.9    1012.0    227.035    A
8565  35061  2017-06-30 21:00:00         -7.1 -19.3    1004.0    244.325    A
8566  35062  2017-06-30 22:00:00         -6.4 -19.3    1008.0    247.470    A
8567  35063  2017-06-30 23:00:00         -5.0 -16.4    1001.0    250.600    A

[1139 rows x 7 columns]

For Eg. here, We can filter with dataset having pressure=1011

In [29]:
e=a[a['pressure']==1011]
e

         ID             datetime  temperature  var1  pressure  windspeed var2
0       552  2013-07-24 00:00:00        -10.0 -16.4    1011.0    263.280    A
1       553  2013-07-24 01:00:00        -10.0 -20.7    1011.0    267.175    A
18      570  2013-07-24 18:00:00         -7.1 -17.1    1011.0     10.390    A
43      595  2013-07-25 19:00:00         -6.4 -20.0    1011.0      4.005    A
90      642  2013-07-27 18:00:00         -7.1 -20.7    1011.0     13.595    A
93      645  2013-07-27 21:00:00         -7.1 -20.0    1011.0      7.760    A
106     658  2013-07-28 10:00:00         -6.4 -19.3    1011.0     10.715    A
114     666  2013-07-28 18:00:00         -6.4 -20.0    1011.0     67.935    A
120     672  2013-07-29 00:00:00         -7.9 -18.6    1011.0     94.290    A
140     692  2013-07-29 20:00:00         -7.9 -18.6    1011.0     61.600    A
529    2185  2013-09-30 01:00:00         -2.1  -1.4    1011.0      5.770    A
1610   7130  2014-04-24 02:00:00         -2.9  -5.0    1011.0      2.765    A
1926   7998  2014-05-30 06:00:00         -7.1 -10.7    1011.0      7.435    A
1955   8027  2014-05-31 11:00:00         -1.4  -7.1    1011.0      3.670    A
1990   8614  2014-06-24 22:00:00         -7.1 -11.4    1011.0      3.165    A
1994   8618  2014-06-25 02:00:00        -10.0 -11.4    1011.0      1.890    A
2005   8629  2014-06-25 13:00:00         -3.6 -12.9    1011.0      3.530    A
2064   8688  2014-06-28 00:00:00         -7.9  -8.6    1011.0      2.140    A
2272   9448  2014-07-29 16:00:00         -5.0 -15.0    1011.0      3.930    A
2292   9468  2014-07-30 12:00:00         -9.3 -10.7    1011.0      6.370    B
2361  10089  2014-08-25 09:00:00         -4.3 -17.1    1011.0     61.340    A
4125  17373  2015-06-24 21:00:00        -10.7 -18.6    1011.0     31.465    A
4134  17382  2015-06-25 06:00:00        -13.6 -21.4    1011.0      4.770    A
4153  17401  2015-06-26 01:00:00        -13.6 -17.9    1011.0      2.515    A
4166  17414  2015-06-26 14:00:00         -7.1 -14.3    1011.0      5.825    A
4175  17423  2015-06-26 23:00:00        -14.3 -16.4    1011.0      2.540    A
4234  17482  2015-06-29 10:00:00         -7.9 -16.4    1011.0     66.560    A
4243  17491  2015-06-29 19:00:00         -7.1 -19.3    1011.0    148.310    A
4631  18983  2015-08-30 23:00:00         -5.0 -16.4    1011.0     16.385    A
6284  26156  2016-06-24 20:00:00         -4.3 -19.3    1011.0     91.435    A
6488  26912  2016-07-26 08:00:00         -7.9 -11.4    1011.0     13.580    A
8388  34332  2017-05-31 12:00:00         -4.3 -18.6    1011.0    314.505    A
8400  34896  2017-06-24 00:00:00         -2.9 -15.0    1011.0     76.925    A
8407  34903  2017-06-24 07:00:00         -7.1 -12.9    1011.0      5.080    A
8414  34910  2017-06-24 14:00:00          0.0 -11.4    1011.0      3.665    A
8424  34920  2017-06-25 00:00:00         -6.4 -10.7    1011.0      6.345    A
8555  35051  2017-06-30 11:00:00         -5.7 -17.1    1011.0    171.915    A

In [30]:
e.shape

(37, 7)

#***DATA SLICING***

---

Slicing 1 column from a given dataframe

In [19]:
a['temperature']

0      -10.0
1      -10.0
2      -10.7
3      -13.6
4      -10.7
        ...
8563    -5.7
8564    -5.7
8565    -7.1
8566    -6.4
8567    -5.0
Name: temperature, Length: 8568, dtype: float64

Slicing column as dataframe from a given dataframe

In [22]:
a[['temperature']]

      temperature
0           -10.0
1           -10.0
2           -10.7
3           -13.6
4           -10.7
...           ...
8563         -5.7
8564         -5.7
8565         -7.1
8566         -6.4
8567         -5.0

[8568 rows x 1 columns]

Slicing multilple columns as dataframe from a given dataframe

In [21]:
a[['temperature','pressure']]

      temperature  pressure
0           -10.0    1011.0
1           -10.0    1011.0
2           -10.7    1003.0
3           -13.6    1008.0
4           -10.7    1006.0
...           ...       ...
8563         -5.7     998.0
8564         -5.7     995.0
8565         -7.1    1004.0
8566         -6.4    1008.0
8567         -5.0    1001.0

[8568 rows x 2 columns]

In [25]:
a.iloc[:,0:1]

         ID
0       552
1       553
2       554
3       555
4       556
...     ...
8563  35059
8564  35060
8565  35061
8566  35062
8567  35063

[8568 rows x 1 columns]

 ***TILL NOW WE DEALT WITH PANDA LIBRARY, NEXT WE WILL DEAL WITH VISUALIZATION METHODS***

---